{
   "statusCode":200,
   "feed":{
      "root":{
         "getMessageCatDefn":[
            {
               "messageSetNbr":"32500",
               "messageNbr":"1",
               "messageText":"Print Your Official Enrollment Verification On-Demand",
               "msgSeverity":"M",
               "descrlong":"<p> The University has partnered with the <a target=\"clearinghouse\" href=\"http://www.studentclearinghouse.org/\">National Student Clearinghouse</a>,
               a nonprofit organization serving the higher education community, enabling you to print your own:</p> <ul> <li> <b>Enrollment Verification Certificates</b> - proof of registration,
               enrollment status, and anticipated graduation date for scholarships, grants, student housing, exchange programs,etc. </li> <li> <b>Good Student Certificates</b> - proof of registration,
               enrollment status, and eligibility for scholarships, grants, discounts and services that require a GPA of 3.00 or higher. </li> <li> This tool also enables you to check information about
               student loan deferments and electronic notifications sent to your lenders. </li> </ul> <p class=\"bf-aca-ver-box\"> The information on these certificates is <em><b>updated weekly</b></em> every
               Tuesday afternoon to reflect your registration status as of 5:00p.m. on the preceding Friday. </p> <p class=\"bf-aca-ver\"> <b>Follow these steps to print your verification:</b> </p> <ul class=\"bf-aca-ver\"> <li> Click the
               <em><b>Self-Service Verifications</b></em> button below. </li> <li> Select and print the appropriate certificate. </li> <li> Attach the certificate to any form(s) required by the organization seeking verification. </li>
               <li> Submit them as directed by your service provider. </li> <li> Log out of the National Student Clearinghouse application. </li> </ul>"
            },
            {
               "messageSetNbr":"32500",
               "messageNbr":"2",
               "messageText":"Request Other Enrollment Verifications",
               "msgSeverity":"M",
               "descrlong":"<p> If you need other types of verifications that require more detailed information you can request them online and they will be sent through the US postal service. </p> <p> Use this service if you need to provide information
               such as your school or college at UC Berkeley, major(s), degree(s) earned, term(s) enrolled, units carried for each term, GPA, class level, etc. <a target=\"registrar\" href=\"http://registrar.berkeley.edu/current_students/registration_enrollment/verification.html\">
               See the full list of other verification services. </a> </p> <p> The information on these verifications reflect your record at the time it is produced, generally 1-2 business days after you submit your request. </p> <p> Your verification will be sent to the address of
               your choice via first-class mail within 3 business days. </p> <p> <b>Follow these steps to request a verification:</b> </p> <ul class=\"bf-aca-ver\"> <li> Click the <em><b>Verifications</b></em> button below. </li> <li> Select Enrollment Verifications Request </li>
               <li> Complete the form and click submit. </li> </ul>"
            },
            {
               "messageSetNbr":"32500",
               "messageNbr":"3",
               "messageText":"Berkeley Law enrollment verification",
               "msgSeverity":"M",
               "descrlong":"To Receive enrollment verification for your law classes you must visit <a href=\"https://www.law.berkeley.edu/academics/registrar/verification-of-attendance/\" target=\"blank\">Berkeley Law enrollment verification</a>."
            },
            {
               "messageSetNbr":"32500",
               "messageNbr":"100",
               "messageText":"Not Officially Registered",
               "msgSeverity":"M",
               "descrlong":"<p>You may not access campus services until you are officially registered.</p> <p>To become officially registered, pay your tuition and fees and clear your outstanding holds.</p>"
            },
            {
               "messageSetNbr":"32500",
               "messageNbr":"101",
               "messageText":"CNP Notification",
               "msgSeverity":"M",
               "descrlong":"Payment of tuition and fees is due the Friday before the first day of instruction. Failure to pay your tuition and fees by this deadline may result in you being dropped from your classes per the Cancellation for Non-Payment policy."
            },
            {
               "messageSetNbr":"32500",
               "messageNbr":"102",
               "messageText":"Grad CNP Notification",
               "msgSeverity":"M",
               "descrlong":"<p>Failure to pay your tuition and fees by the fifth week of instruction will result in you being dropped from your classes per the Cancellation for Non-Payment Policy. </p> <p>Learn more about UC Berkeley’s <a href'=\"http://www.berkeley.edu/\" target=\"blank\">
               Cancellation for Non-Payment policy</a>/</p>"
            },
            {
               "messageSetNbr":"32500",
               "messageNbr":"103",
               "messageText":"CNP Warning",
               "msgSeverity":"M",
               "descrlong":"<p>Your tuition and fees have not been paid. Failure to pay your tuition and fees by the Friday before the start of instruction may result in you being dropped from your classes per the Cancellation for Non-Payment policy.</p> <p>To maintain your current course schedule and avoid cancellation, please pay your tuition and fees.</p>"
            },
            {
               "messageSetNbr":"32500",
               "messageNbr":"104",
               "messageText":"Grad CNP Warning",
               "msgSeverity":"M",
               "descrlong":"<p>Your tuition and fees have not been paid. Failure to pay your tuition and fees by the fifth week of instruction will result in you being dropped from your classes per the Cancellation for Non-Payment Policy. </p> <p>To maintain your current course schedule and avoid cancellation, please
               pay your tuition and fees.</p> <p>Learn more about UC Berkeley’s Cancellation for Non-Payment policy. Your tuition and fees have not been paid. Failure to pay your tuition and fees by the fifth week of instruction will result in you being dropped from your classes per the Cancellation for Non-Payment Policy. </p>
               <p>To maintain your current course schedule and avoid cancellation, please pay your tuition and fees.</p> <p>Learn more about UC Berkeley’s Cancellation for Non-Payment policy.</p>"
            },
            {
               "messageSetNbr":"32500",
               "messageNbr":"105",
               "messageText":"Not Enrolled",
               "msgSeverity":"M",
               "descrlong":"<p>You are not enrolled in any classes for this term. </p> <p>For more information, please contact <a href=\"http://studentcentral.berkeley.edu/\" target=\"blank\">Cal Student Central</a> in 120 Sproul Hall. </p>"
            },
            {
               "messageSetNbr":"32500",
               "messageNbr":"106",
               "messageText":"Not Enrolled (Grad)",
               "msgSeverity":"M",
               "descrlong":"<p>You are not enrolled in any classes for this term.</p> <p>For more information, please contact your departmental graduate advisor.</p>"
            }
         ]
      }
   }
}
